# Weekly Paper : Week2 
DA18 임지호

### Q. Excel로 데이터를 집계할 때, 피벗 테이블을 쓰는 방식과 SUMIF·COUNTIF 같은 수식으로 직접 계산하는 방식 중 어느 쪽이 더 좋다고 생각하나요? 선택한 이유와 함께 설명해 보세요.

피벗 테이블을 쓰는 방식이 더 효율적이라고 생각합니다. 먼저, 피벗 테이블과 엑셀 수식의 특성을 봐보겠습니다. 피벗 테이블의 경우 지정한 데이터의 개수/평균/비율 등의 다양한 값을 클릭 몇 번으로 빠르게 살펴볼 수 있습니다. 데이터 수가 많아도 빠른 처리가 가능하다는 장점도 가지고 있습니다. 그러나, 피벗 테이블 내에서 데이터 변경이 어려운 점, 그리고 원본 데이터가 변경되어도 자동 반영되지 않고 새로고침을 해주어야 한다는 점이 단점이라고 볼 수 있습니다. 엑셀 수식의 경우, 자유로운 데이터 수정이 가능하다는 장점이 있습니다. 피벗테이블과 달리 값이 수정되어도 결과에 바로 반영이 됩니다. 그러나, 데이터 수가 많아지면 속도가 느려진다는 점, 그리고 다양한 결과값(개수, 평균, 비율 등)을 보기 위해서는 수식을 하나하나 입력해주어야 한다는 단점이 있습니다. 

호텔 예약 데이터 분석이 필요한 상황이라고 가정해 보겠습니다. 받은 데이터에는 예약 번호, 고객 ID, 결제 금액, 결제 일자, 방문 고객의 유형, 국적, 과거 기록 등 다양한 정보가 들어있습니다. 이런 상황에서 데이터 간의 다양한 상관관계를 살펴보기 위해서는 빠르게 데이터를 훑어볼 필요가 있습니다. 월별 예약 추이나 재방문 고객의 비율 등 그래프의 x축과 y축의 데이터를 바꿔가며 전체 데이터를 살펴보기 위해서는 피벗테이블이 가장 유용하다고 생각합니다. 엑셀 수식으로 원하는 목적에 따라 데이터를 하나하나 가공하며 불필요하게 시간을 소모하기보다는 피벗테이블로 열, 행, 값에 데이터를 여러 형태로 넣어보고 그 결과를 해석하는 것이 효율적이라고 생각하기 때문입니다.

물론, 실시간으로 데이터가 변하거나 레이아웃이 고정되어 있는 경우에서는 굳이 피벗테이블을 활용하지 않고 엑셀 수식을 사용하는 것이 유용하다고 생각합니다. 하지만, 데이터 분석을 위해 여러 각도로 데이터를 살펴보는 목적에서라면 엑셀 수식보다는 피벗 테이블이 더 유용한 방식이라고 생각합니다.

### Q. 리스트(list)와 딕셔너리(dict)는 어떤 상황에서 각각 사용하나요? 데이터 분석 업무를 예시로 들어 설명해 보세요.

리스트는 순서를 가진 값이 나열되어 있고, 딕셔너리는 key와 value로 이루어져 있습니다. 
리스트 안의 값은 순서를 가지고 있습니다. 그렇기에 순서를 지켜야 하는 데이터 분석 업무의 경우 리스트를 사용하게 됩니다. 예를 들어 리스트에 월별 매출 데이터가 1월부터 12월까지 차례대로 들어있으면, 이를 이용해 매출 총합이나 평균을 구할 수 있습니다. 또, 순서가 있는 반복 작업을 수행할 때도 리스트를 사용할 수 있습니다. 예를 들어, 어떤 데이터의 가공 프로세스가 리스트에 [1번 과정, 2번 과정, 3번 과정]으로 들어있을 때, for문을 사용해 1번부터 3번까지 돌아가도록 설정해줄 수 있습니다. 이처럼 순서가 중요한 상황에서는 리스트를 사용할 수 있습니다.
딕셔너리에서는 key와 value가 서로 짝을 이루고 있습니다. 그래서 데이터의 범주를 설정할 때, 딕셔너리를 사용할 수 있습니다. 예를 들어, 데이터가 숫자로 들어올 때, 이 값을 이해하기 쉬운 값으로 변경해줄 수 있습니다. 데이터가 배송 과정을 숫자로 표현하고 있다고 가정해보겠습니다. 1~3까지의 숫자로 배송 상태가 표현될 떄, 1 : '결제완료', 2 : '배송중', 3 : '배송완료'와 같이 직관적으로 이해할 수 있는 표현으로 바꿔주기 위해서 딕셔너리를 사용할 수 있습니다. 두 번째로, 빠르게 데이터를 찾을 때에는 리스트보다 딕셔너리가 더 유용합니다. 리스트는 순서를 가진 값이기에, 값을 처음부터 끝까지 순서대로 찾게 됩니다. 하지만, 딕셔너리는 key와 value로 연결되어 있기에, 값을 더 빠르게 찾을 수 있습니다. 이처럼 특정 값을 찾거나, 범주형 데이터를 다룰 때, 딕셔너리를 사용할 수 있습니다.
